Revit 2026 API

# BRepBuilderGeometryId Methods

---

The BRepBuilderGeometryId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | InvalidGeometryId | Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

BRepBuilderGeometryId Class

Autodesk.Revit.DB Namespace